Tekla Open API Reference for Tekla Structures 2025
InputItem.GetData Method
 Returns the data of the input item. See also: InputItem.InputTypeEnum.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object GetData()
Public Function GetData As Object
Return Value
Type: Object
The input data.
See Also
Reference
InputItem Class
Tekla.Structures.Model Namespace